In [1]:
from sqlitepandas import DB, pd

In [2]:
db = DB("test.db")

In [3]:
df = pd.DataFrame({"col1": ['a','b','c'], "col2": ['d','f','g']})
df

  col1 col2
0    a    d
1    b    f
2    c    g

In [4]:
#db.execute_query("Your custom SQL query")

In [5]:
db.create_table("my_table_name", df)

DROP TABLE IF EXISTS my_table_name;
CREATE TABLE `my_table_name` (`ID` INTEGER PRIMARY KEY, `col1` TEXT, `col2` TEXT);

In [6]:
db.get_table("my_table_name", as_dict=False, chunk_size=None)

   ID col1 col2
0   1    a    d
1   2    b    f
2   3    c    g

In [7]:
db.append_table("my_table_name", df)

In [8]:
db.get_table("my_table_name", as_dict=True)

{'ID': [1, 2, 3, 4, 5, 6],
 'col1': ['a', 'b', 'c', 'a', 'b', 'c'],
 'col2': ['d', 'f', 'g', 'd', 'f', 'g']}

In [9]:
db.remove_table("my_table_name")

DROP TABLE my_table_name

True

In [10]:
db.create_table("my_table_name", df)

DROP TABLE IF EXISTS my_table_name;
CREATE TABLE `my_table_name` (`ID` INTEGER PRIMARY KEY, `col1` TEXT, `col2` TEXT);

In [11]:
db.create_table("my_other_table_name", df)

DROP TABLE IF EXISTS my_other_table_name;
CREATE TABLE `my_other_table_name` (`ID` INTEGER PRIMARY KEY, `col1` TEXT, `col2` TEXT);

In [12]:
db.get_tables(["my_table_name", "my_other_table_name"], as_dict=True, chunk_size=None)

{'my_other_table_name': {'ID': [1, 2, 3],
  'col1': ['a', 'b', 'c'],
  'col2': ['d', 'f', 'g']},
 'my_table_name': {'ID': [1, 2, 3],
  'col1': ['a', 'b', 'c'],
  'col2': ['d', 'f', 'g']}}

In [13]:
one_row_df = pd.DataFrame({"col1": ['one row'], "col2": ['one row']})
one_row_df

      col1     col2
0  one row  one row

In [14]:
db.add_row("my_table_name", one_row_df)

INSERT INTO my_table_name ('col1', 'col2') VALUES ('one row', 'one row');

True

In [15]:
db.get_table("my_table_name", as_dict=False)

   ID     col1     col2
0   1        a        d
1   2        b        f
2   3        c        g
3   4  one row  one row

In [16]:
df = pd.DataFrame({"col1": ['more rows', 'more rows'], "col2": ['more rows', 'more rows']})

In [17]:
db.add_rows("my_table_name", df)

INSERT INTO my_table_name ('col1', 'col2') VALUES ('more rows', 'more rows');
INSERT INTO my_table_name ('col1', 'col2') VALUES ('more rows', 'more rows');

In [18]:
db.get_table("my_table_name", as_dict=False)

   ID       col1       col2
0   1          a          d
1   2          b          f
2   3          c          g
3   4    one row    one row
4   5  more rows  more rows
5   6  more rows  more rows

In [19]:
db.get_row("my_table_name", row_index=None, column_name="col1", row_value="one row", as_dict=False, chunk_size=None)

   ID     col1     col2
3   4  one row  one row

In [20]:
db.get_row("my_table_name", row_index=4, column_name=None, row_value=None, as_dict=False, chunk_size=None)

   ID     col1     col2
3   4  one row  one row

In [21]:
db.get_rows("my_table_name", row_indexes=None, column_name="col1", row_values=["a", "b", "c"], as_dict=False, chunk_size=None)

   ID col1 col2
0   1    a    d
1   2    b    f
2   3    c    g

In [22]:
db.get_rows("my_table_name", row_indexes=[2,3], column_name=None, row_values=None, as_dict=False, chunk_size=None)

   ID col1 col2
1   2    b    f
2   3    c    g

In [23]:
df = db.get_table("my_table_name", as_dict=False)
df

   ID       col1       col2
0   1          a          d
1   2          b          f
2   3          c          g
3   4    one row    one row
4   5  more rows  more rows
5   6  more rows  more rows

In [24]:
one_row_df = df[df["col1"] == "a"]
one_row_df

   ID col1 col2
0   1    a    d

In [25]:
db.remove_row("my_table_name", one_row_df, id_value=None)

DELETE FROM `my_table_name` WHERE `col2`='d' AND `col1`='a' AND `ID`='1'

True

In [26]:
db.get_table("my_table_name", as_dict=False)

   ID       col1       col2
0   2          b          f
1   3          c          g
2   4    one row    one row
3   5  more rows  more rows
4   6  more rows  more rows

In [27]:
db.remove_row("my_table_name", one_row_df=None, id_value=4)

DELETE FROM `my_table_name` WHERE `ID`='4'

True

In [28]:
df = db.get_table("my_table_name", as_dict=False)
df

   ID       col1       col2
0   2          b          f
1   3          c          g
2   5  more rows  more rows
3   6  more rows  more rows

In [29]:
df = df[df["col1"].str.contains("rows")]
df

   ID       col1       col2
2   5  more rows  more rows
3   6  more rows  more rows

In [30]:
db.remove_rows("my_table_name", df=df, id_values=None)

DELETE FROM `my_table_name` WHERE `col1`='more rows' AND `ID`='5' AND `col2`='more rows'
DELETE FROM `my_table_name` WHERE `ID`='6' AND `col1`='more rows' AND `col2`='more rows'

In [31]:
df = db.get_table("my_table_name", as_dict=False)
df

   ID col1 col2
0   2    b    f
1   3    c    g

In [32]:
db.remove_rows("my_table_name", df=None, id_values=[2])

DELETE FROM `my_table_name` WHERE `ID`='2'

In [33]:
df = db.get_table("my_table_name", as_dict=False)
df

   ID col1 col2
0   3    c    g

In [34]:
df.loc[0, 'col1'] = "new value"
df.loc[0, 'col2'] = "another new value"
df

   ID       col1               col2
0   3  new value  another new value

In [35]:
db.update_cells("my_table_name", df)

UPDATE `my_table_name` SET `col1`='new value' WHERE `ID`='3';
UPDATE `my_table_name` SET `col2`='another new value' WHERE `ID`='3';

In [36]:
db.get_table("my_table_name", as_dict=False)

   ID       col1               col2
0   3  new value  another new value